src/Reports/Визуализация/Визуализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Визуализация</name>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ЛьготнаяОчередь/ЛьготнаяОчередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛьготнаяОчередь</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаРасходов</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Виртуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахожденияВБуфере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоМощности</name>
    <type>
      <types>CatalogRef.ГруппыПоМощности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияСпецификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Канбан</name>
    <type>
      <types>CatalogRef.ВидыКанбанов</types>
    </type>
  </attributes>
  <attributes>
    <name>КолВКанбане</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КолКанбан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Промывка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловныеПриборы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловныйКоэффициентПЭО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблоныТО</name>
    <type>
      <types>CatalogRef.ШаблоныТехОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроизводства</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноКОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходНаРедизайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛинииSMD</name>
    <attributes>
      <name>Линия</name>
      <type>
        <types>CatalogRef.ЛинииSMD</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиSMD</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/Визуализация/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Перем КлючФЗ,КлючВХ,НачалоЗамера;
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЭтаФорма.Параметры.Линейка.Пустая() Тогда
	Отчет.Линейка = ЭтаФорма.Параметры.Линейка;
		Если Не ЭтаФорма.Параметры.Товар.Пустая() Тогда
		ПолучитьСписокНоменклатуры(ЭтаФорма.Параметры.Товар);
		ДатаОтгрузки = ЭтаФорма.Параметры.ДатаОтгрузки;
		КонецЕсли;
	Сформировать(Неопределено);
	КонецЕсли; 
КлючУникальности = Новый УникальныйИдентификатор();
ЭтаФорма.Заголовок = "Визуализация "+Отчет.Линейка;
КонецПроцедуры
                             
&НаКлиенте
Процедура ЛинейкаПриИзменении(Элемент)
ЭтаФорма.Заголовок = "Визуализация "+Отчет.Линейка;
КонецПроцедуры

&НаКлиенте
Процедура ЛинейкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ОбщийМодульВызовСервера.ЭтоЛинейкаКанбан(ВыбранноеЗначение) Тогда
	СтандартнаяОбработка = Ложь;
	Сообщить("Выберите приборную линейку!");
	КонецЕсли;
КонецПроцедуры

&НаСервере   
Функция ПолучитьСостояниеФЗ(Ключ) 
Возврат(ФоновоеВыполнение.НайтиЗадание(Ключ));
КонецФункции 
           
&НаСервере
Процедура ПолучитьРезультатФЗ(КлючВХ)
ТабДок = ПолучитьИзВременногоХранилища(КлючВХ);
ТабДок.ПоказатьУровеньГруппировокСтрок(Не СвернутьПоМТК);
ТабДок.ПоказатьУровеньГруппировокКолонок(ИнформацияПоВыпускам);                                      
КонецПроцедуры

&НаКлиенте   
Функция СостояниеФЗ() Экспорт 
Результат = ПолучитьСостояниеФЗ(КлючФЗ);
	Если Результат.Выполняется Тогда
	ВремяФормирования = "Формирование отчёта...";
	ИначеЕсли Результат.Успех Тогда
	ОтключитьОбработчикОжидания("СостояниеФЗ");
	ПолучитьРезультатФЗ(КлючВХ);   
	Элементы.Сформировать.Доступность = Истина;
	ВремяФормирования = Формат((ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоЗамера)/60000,"ЧДЦ=1")+" мин.";	
	Иначе
   	ВремяФормирования = Результат.Ошибка;
	ОтключитьОбработчикОжидания("СостояниеФЗ");
	КонецЕсли;
Возврат(Не Результат.Выполняется);
КонецФункции

&НаСервере      
Функция СформироватьОтчёт(Адрес)
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
ТекстФоновойПроцедуры = "ФоновоеВыполнение.СформироватьВизуализацию(Макет,Линейка,СписокНоменклатуры,ДатаОтгрузки,Адрес);";                                                                                                                                                                                                                        
ПараметрыФЗ = Новый Структура("Макет,Линейка,СписокНоменклатуры,ДатаОтгрузки,Адрес",ОбъектЗн.ПолучитьМакет("Визуализация"),Отчет.Линейка,СписокНоменклатуры,ДатаОтгрузки,Адрес);
Ключ = ФоновоеВыполнение.ЗапуститьФоновоеВыполнение(ТекстФоновойПроцедуры,ПараметрыФЗ);
Возврат(Ключ);
КонецФункции 

&НаКлиенте
Процедура Сформировать(Команда)
НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
Элементы.Сформировать.Доступность = Ложь;
ВремяФормирования = "Формирование отчёта...";   
КлючВХ = ПоместитьВоВременноеХранилище(Неопределено,ЭтаФорма.КлючУникальности);
КлючФЗ = СформироватьОтчёт(КлючВХ);
ПодключитьОбработчикОжидания("СостояниеФЗ",5,Ложь);
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокНоменклатуры(Товар)
СписокНоменклатуры.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Товар = &Товар";
Запрос.УстановитьПараметр("Товар", Товар);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Функция ПолучитьЛО(Расшифровка)
СписокЛО = Новый СписокЗначений;
ЗапросЛО = Новый Запрос;

ЗапросЛО.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЛьготнаяОчередь.Период) КАК Период,
	|	ЛьготнаяОчередь.НормаРасходов.Элемент КАК МПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь КАК ЛьготнаяОчередь
	|ГДЕ
	|	ЛьготнаяОчередь.Изделие = &Изделие
	|	И ЛьготнаяОчередь.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛьготнаяОчередь.НормаРасходов.Элемент";
ЗапросЛО.УстановитьПараметр("Изделие",Расшифровка);
РезультатЗапроса = ЗапросЛО.Выполнить();
ВыборкаЛО = РезультатЗапроса.Выбрать();
	Пока ВыборкаЛО.Следующий() Цикл
	СписокЛО.Добавить(ВыборкаЛО.МПЗ,СокрЛП(ВыборкаЛО.МПЗ.Наименование)+" ("+ВыборкаЛО.Период+")"); 
	КонецЦикла;
Возврат(СписокЛО);
КонецФункции

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
ИмяКолонки = СокрЛП(Сред(Элемент.ТекущаяОбласть.Имя,Найти(Элемент.ТекущаяОбласть.Имя,"C"))); 
НомерКолонки = Сред(ИмяКолонки,2);
	Если Найти(НомерКолонки,":") > 0 Тогда
	НомерКолонки = Число(Лев(НомерКолонки,Найти(НомерКолонки,":")-1));	
	Иначе
    НомерКолонки = Число(НомерКолонки);
	КонецЕсли;
        Если НомерКолонки = 9 Тогда
		СтандартнаяОбработка = Ложь;
		СписокЛО = ПолучитьЛО(Расшифровка);
		Выборка = СписокЛО.ВыбратьЭлемент("Льготная очередь");
			Если Выборка <> Неопределено Тогда
			ИмяОтчета = "ОтчётПоРегиструЛьготнойОчереди";
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
			ПараметрыФормы.Вставить("ПользовательскиеНастройки",ОбщийМодульВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчетаСКД(ИмяОтчета,НачалоГода(ТекущаяДата()),ТекущаяДата(),Новый Структура("Линейка,Изделие,НормаРасходовЭлемент",Отчет.Линейка,Расшифровка,Выборка.Значение),"ТекущаяЛьготнаяОчередь"));
			ПараметрыФормы.Вставить("КлючВарианта","ТекущаяЛьготнаяОчередь"); 
			ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы);
			КонецЕсли;
		ИначеЕсли НомерКолонки = 10 Тогда
		СтандартнаяОбработка = Ложь;
		ИмяОтчета = "ОтчётПоРемонтуСКД";
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
		ПараметрыФормы.Вставить("ПользовательскиеНастройки",ОбщийМодульВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчетаСКД(ИмяОтчета,Неопределено,Неопределено,Новый Структура("ДокументОснование,Проведен",Расшифровка,Ложь),"ТекущийРемонт"));
		ПараметрыФормы.Вставить("КлючВарианта","ТекущийРемонт"); 
		ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыФормы);
		КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПоМТКПриИзменении(Элемент)
ТабДок.ПоказатьУровеньГруппировокСтрок(Не СвернутьПоМТК); 
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияПоВыпускамПриИзменении(Элемент)
ТабДок.ПоказатьУровеньГруппировокКолонок(ИнформацияПоВыпускам);
КонецПроцедуры
